:PROPERTIES:
:header-args:lisp: :results verbatim :exports both :package mlx-user :eval no-export :dir (expand-file-name "../../")
:END:
#+title: MLX-CL/IO/JPEG
#+subtitle: Support JPEG file read and write
#+author: 凉凉
#+html_head: <!-- The documentation is generated on 11111000000/tao-theme-emacs (tao-yin) with org literal programming style.  -->
#+html_head: <!-- The Unifont is destributed on cdn.jsdelivr.net -->
#+html_head: <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/@fontsource/unifont@5.2.5/index.min.css">
#+html_head: <style> body { font-size: 1.05em; background-color: #171717; color: #dadada } </style>
#+html_head: <style> pre, code { font-family: "Unifont", monospace; }</style>
#+html_head: <style> pre { background-color: #171717; } </style>
#+html_head: <style> a { display: inline-block; border: 1px solid; border-radius: 0px; border-color: #f6f6f6; text-decoration: none; color: #f6f6f6; padding: 1px; margin: 1px; } </style>
#+html_head: <style> a:hover { color: #0e0e0e; background-color: #c3c3c3 } </style>
#+html_head: <style> .title { padding-top: 100px; padding-bottom: 10px } </style>
** Reading JPEG file
#+begin_src lisp
  (mlx-array "./res/img/avatar.jpg")
#+end_src

#+RESULTS:
#+begin_example
array([[[254, 254, 254],
        [254, 254, 254],
        [254, 254, 254],
        ...,
        [254, 254, 254],
        [254, 254, 254],
        [254, 254, 254]],
       [[254, 254, 254],
        [254, 254, 254],
        [254, 254, 254],
        ...,
        [254, 254, 254],
        [254, 254, 254],
        [254, 254, 254]],
       [[254, 254, 254],
        [254, 254, 254],
        [254, 254, 254],
        ...,
        [254, 254, 254],
        [254, 254, 254],
        [254, 254, 254]],
       ...,
       [[254, 254, 254],
        [254, 254, 254],
        [254, 254, 254],
        ...,
        [254, 254, 254],
        [254, 254, 254],
        [254, 254, 254]],
       [[254, 254, 254],
        [254, 254, 254],
        [254, 254, 254],
        ...,
        [254, 254, 254],
        [254, 254, 254],
        [254, 254, 254]],
       [[254, 254, 254],
        [254, 254, 254],
        [254, 254, 254],
        ...,
        [254, 254, 254],
        [254, 254, 254],
        [254, 254, 254]]], dtype=uint8)
#+end_example

*NOTE*: it's better if you load =mlx-cl/image= subsystem, you could
use =mlx.img:image= function to load image file.

#+begin_src lisp
  (mlx.img:image "./res/img/avatar.jpg")
#+end_src

#+RESULTS:
: #<mlx-cl.image:image(240x241 :rgb)>

